000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ОрганизацииПодразделений/ОрганизацииПодразделений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОрганизацииПодразделений</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Владелец</name>
    <comment>Элемент справочника, периодичность реквизита которого мы обеспечиваем.</comment>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/Магазины/Магазины.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Магазины</name>
  <attributes>
    <name>Блокирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВведенВЭксплуатацию</name>
    <comment>Магазин переведен в режим работы 1С:Розница</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДеятельности</name>
    <type>
      <types>CatalogRef.ВидыДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМинимальныхЦенПродажи</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>CatalogRef.Города</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПользователей</name>
    <type>
      <types>CatalogRef.ГруппыПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаФизЛиц</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРаботы</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриОтгрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриПеремещении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриПоступлении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПрименениеЦен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПрямуюИнкассацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КассаМагазина</name>
    <comment>Основная денежная касса магазина</comment>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>КодБюджета</name>
    <type>
      <types>CatalogRef.КодыБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>КодФилиала</name>
    <comment>Navision</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьАссортимент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерМагазина</name>
    <comment>Используется для начальной загрузки из MForce</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделениеОрганизации</name>
    <comment>Определяет филиал</comment>
    <type>
      <types>CatalogRef.ОбособленныеПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтменаРучныхСкидок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПерсональныеПродажи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подпись</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокОкругленияСуммыЧекаВПользуПокупателя</name>
    <type>
      <types>EnumRef.ПорядкиОкругления</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоЦенообразования</name>
    <type>
      <types>CatalogRef.ПравилаЦенообразования</types>
    </type>
  </attributes>
  <attributes>
    <name>СегментИсключаемойНоменклатуры</name>
    <type>
      <types>CatalogRef.СегментыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПереброски</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПоступления</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПродажи</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладСвязи</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладУправляющейСистемы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматМагазина</name>
    <type>
      <types>CatalogRef.ФорматыМагазинов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Область</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/Склады/Склады.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Склады</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>IDN</name>
    <comment>NAV: Код склада в Navision</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Блокирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодИзменения</name>
    <comment>NAV: timestamp</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеСклада</name>
    <type>
      <types>EnumRef.НазначенияСкладов</types>
    </type>
  </attributes>
  <attributes>
    <name>Отдел</name>
    <comment>Соответствие организациям в Navision</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипСклада</name>
    <type>
      <types>EnumRef.ТипыСкладов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Пользователи</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Область</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/CommonModules/ЗапасыПовтИсп/Module.bsl
//	LNK 02.06.2017 13:33:33
Функция ДанныеМагазинаЦенообразование(Магазин)	Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаВедущая.Ссылка КАК Магазин,
	|	ТаблицаВедущая.ВидМинимальныхЦенПродажи КАК ВидМинимальныхЦенПродажи,
	|	ТаблицаВедущая.ИспользоватьПрименениеЦен КАК ИспользоватьПрименениеЦен,
	|	ТаблицаВедущая.ПравилоЦенообразования КАК ПравилоЦенообразования,
	|	ТаблицаВедущая.ФорматМагазина КАК ФорматМагазина,
	|	ЕСТЬNULL(ТаблицаОрганизаций.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК Организация
	|ИЗ
	|	Справочник.Магазины КАК ТаблицаВедущая
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОрганизацииПодразделений.СрезПоследних(&Период, ) КАК ТаблицаОрганизаций
	|		ПО ТаблицаВедущая.Ссылка = ТаблицаОрганизаций.Владелец
	|ГДЕ
	|	ТаблицаВедущая.Ссылка = &Магазин"
	);
	Запрос.УстановитьПараметр("Период" , ТекущаяДата());	//	LNK 15.11.2023 16:52:55
	Запрос.УстановитьПараметр("Магазин", Магазин);
	
	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	Выборка.Следующий();
	
	ДанныеМагазина = Новый Структура;
	ОбщегоНазначенияРТ.ПеренестиСтрокуВыборкиВСтруктуру(Результат, Выборка, ДанныеМагазина);

	Возврат ДанныеМагазина;

КонецФункции

//	LNK 02.06.2017 15:43:02
Функция ДанныеСклада(Склад)	Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаВедущая.Ссылка КАК Склад,
	|	ЕСТЬNULL(ТаблицаОрганизаций.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК Организация
	|ИЗ
	|	Справочник.Склады КАК ТаблицаВедущая
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОрганизацииПодразделений.СрезПоследних(&Период, ) КАК ТаблицаОрганизаций
	|		ПО ТаблицаВедущая.Магазин = ТаблицаОрганизаций.Владелец
	|ГДЕ
	|	ТаблицаВедущая.Ссылка = &Склад"
	);
	Запрос.УстановитьПараметр("Период", ТекущаяДата());	//	LNK 15.11.2023 16:52:55
	Запрос.УстановитьПараметр("Склад" , Склад);
	
	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	Выборка.Следующий();
	
	ДанныеСклада = Новый Структура;
	ОбщегоНазначенияРТ.ПеренестиСтрокуВыборкиВСтруктуру(Результат, Выборка, ДанныеСклада);

	Возврат ДанныеСклада;

КонецФункции // ДанныеСклада()

//	LNK 02.06.2017 13:52:44
Функция ДанныеНоменклатуры(Номенклатура, Упаковка = Неопределено)	Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаНоменклатура.Ссылка КАК Номенклатура,
	|	ТаблицаНоменклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	|	ТаблицаНоменклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ТаблицаНоменклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ТаблицаНоменклатура.ИспользоватьСерийныеНомера КАК ИспользоватьСерийныеНомера,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТаблицаУпаковки.Коэффициент, 0) = 0
	|			ТОГДА 1
	|		ИНАЧЕ ТаблицаУпаковки.Коэффициент
	|	КОНЕЦ КАК Коэффициент,
	|	ТаблицаНоменклатура.Номинал КАК Номинал
	|ИЗ
	|	Справочник.Номенклатура КАК ТаблицаНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиНоменклатуры КАК ТаблицаУпаковки
	|		ПО (ТаблицаУпаковки.Владелец ССЫЛКА Справочник.Номенклатура)
	|			И ТаблицаНоменклатура.Ссылка = ТаблицаУпаковки.Владелец
	|			И (ТаблицаУпаковки.Ссылка = &Упаковка)
	|ГДЕ
	|	ТаблицаНоменклатура.Ссылка = &Номенклатура"
	);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Упаковка"    , Упаковка);
	
	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	Выборка.Следующий();
	
	ДанныеТовара = Новый Структура;
	ОбщегоНазначенияРТ.ПеренестиСтрокуВыборкиВСтруктуру(Результат, Выборка, ДанныеТовара);

	Возврат ДанныеТовара;

КонецФункции

//	LNK 16.06.2020 07:52:07
Функция ДанныеСерийногоНомера(СерийныйНомер)	Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаСправочник.Ссылка КАК СерийныйНомер,
	|	ТаблицаВладельца.Ссылка КАК Номенклатура,
	|	ТаблицаВладельца.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ТаблицаВладельца.ИспользоватьСерийныеНомера КАК ИспользоватьСерийныеНомера
	|ИЗ
	|	Справочник.СерийныеНомера КАК ТаблицаСправочник
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК ТаблицаВладельца
	|		ПО ТаблицаСправочник.Владелец = ТаблицаВладельца.Ссылка
	|ГДЕ
	|	ТаблицаСправочник.Ссылка = &СерийныйНомер"
	);
	Запрос.УстановитьПараметр("СерийныйНомер", СерийныйНомер);

	Результат = Запрос.Выполнить();
	Выборка   = Результат.Выбрать();
	Выборка.Следующий();

	ДанныеСерийногоНомера = Новый Структура;
	ОбщегоНазначенияРТ.ПеренестиСтрокуВыборкиВСтруктуру(Результат, Выборка, ДанныеСерийногоНомера);

	Возврат ДанныеСерийногоНомера;

КонецФункции

Функция ПолучитьКодыПроектов(ВернутьСоответствие = Ложь)	Экспорт

	Возврат Справочники.ВидыНоменклатуры.ПолучитьКодыПроектов(ВернутьСоответствие);

КонецФункции
